import java.util.Scanner;

public class Main {

	public static void main(String[] args) {
		Scanner scn = new Scanner(System.in);
		int n;

		n = scn.nextInt();

		/****************************************
		 *  1  2  3  4  5  6  7  8  9 10
		 * [1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
		 * [1, 0, 1, 0, 1, 0, 1, 0, 1, 0]
		 * [1, 0, 0, 0, 1, 1, 1, 0, 0, 0]
		 * [1, 0, 0, 1, 1, 1, 1, 1, 0, 0]
		 * [1, 0, 0, 1, 0, 1, 1, 1, 0, 1]
		 * [1, 0, 0, 1, 0, 0, 1, 1, 0, 1]
		 * [1, 0, 0, 1, 0, 0, 0, 1, 0, 1]
		 * [1, 0, 0, 1, 0, 0, 0, 0, 0, 1]
		 * [1, 0, 0, 1, 0, 0, 0, 0, 1, 1]
		 * [1, 0, 0, 1, 0, 0, 0, 0, 1, 0]
		 * 
		 * 약수의 개수가 홀수 : 1, 짝수 : 0
		 * 약수의 개수가 홀수 → 제곱수
		 ****************************************/
		System.out.println((int) Math.sqrt(n));
	}

}